basicCaseTesting/0.orig/pointDisplacement.template
/*-----------------------------*- C++ -*-------engine:jinja2-----------------*\

| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 0 0 0 0 0];

internalField uniform(0 0 0);

boundaryField
{
  bottom
  {
      type        groovyBC;
      value       uniform (0 0 0);
      valueExpression "toPoint(cellDisplacement)";

  }
  
  top
  {
      type        fixedValue;
      value       uniform (0 0 0);
  }
  
  "(left|right|inlet|outlet)"
  {
      type        empty;
  }
}
