basicCaseTesting/constant/turbulenceProperties
/*--------------------------------*- C++ -*---------------engine:jinja2-------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


simulationType      LES;

LES{
    
        LESModel        dynamicSmagorinsky;
        dynamicSmagorinskyCoeffs
        {
            filter        simple;
            Cs              0.065;
            Ce              1.048; 
            Ck              0.02655; 
        }
        
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
        
        vanDriestCoeffs
        {
            delta           cubeRootVol;
            cubeRootVolCoeffs
            {
                deltaCoeff      1;
            }
            Aplus           26;
            Cdelta          0.158;
        }
    
        
        
        
    
    
    
        
    
    
    

    printCoeffs     on;
    turbulence      on;
}


// ************************************************************************* //