basicCaseTesting/system/FOQ
/*--------------------------------*- C++ -*---------engine:jinja2-------------------------*\

| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |

|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Channel wall shear stress
    wallShearStress
    {
        type                wallShearStress;
        libs                ("libfieldFunctionObjects.so");
        log                 yes;
        patches             ( bottom top );
        writePrecision      10;
        writeFields         yes;
        writeToFile         yes;
        executeControl      timeStep;
        executeInterval     1;
        writeControl        writeTime;
        timeStart           0;
    }
