basicCaseTesting/system/FOlambda2
/*--------------------------------*- C++ -*---------engine:jinja2-------------------------*\

| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |

|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    // Lambda criterion for turbulence visualization
    Lambda21
    {
        // Mandatory entries
        type            Lambda2;
        libs            ("libfieldFunctionObjects.so");

        // Optional (inherited) entries
        field           U;
        timeStart       0;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
    }
