basicCaseTesting/system/FOpressureDiff
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pressureDiff { 
	type patchExpression;
	patches ( 
	   inlet 
	);
	variables ( 
	    "pOut{outlet}=sum(p*area())/sum(area());" 
	);
	accumulations ( 
	    weightedAverage
	);
	expression "p-pOut";
	verbose true;
	outputControlMode timeStep;
	outputInterval 1;
	writeStartTime 0;
}
