basicCaseTesting/system/FOstrainRate
/*--------------------------------*- C++ -*---------engine:jinja2-------------------------*\

| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |

|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    // Strain rate magnitude
    strainRate
    {
        type            strainRate;
        libs            ("libfieldFunctionObjects.so");
        field           U;
        result          StrainRate;
        executeControl  writeTime;
        writeControl    writeTime;
    }
