basicCaseTesting/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;


// L:length, H:height, W:width
L       5.60998688141;
H       1.0;
W       2.9919930042;
H2       2;
Ls       0.25;

vertices
(
    ( 0   0   0)
    ($L   0   0)
    ($L  $H   0)
    ($L $H2   0)
    ( 0 $H2   0)
    ( 0  $H   0)

    ( 0   0  $W)
    ($L   0  $W)
    ($L  $H  $W)
    ($L $H2  $W)
    ( 0 $H2  $W)
    ( 0  $H  $W)

//    ($Ls  0  0)
//    ($Ls  0  $W)


);

blocks
(
    hex ( 0  1  2  5  6  7  8 11) (32 16 32) simpleGrading (1 8 1)
    hex ( 5  2  3  4 11  8  9 10) (32 16 32) simpleGrading (1 -8 1)
);

boundary
(
    bottom
    {
        type            wall;
        faces           ((0 6 7 1));
    }
    top
    {
        type            wall;
        faces           ((4 3 9 10));
    }
    left
    {
        type            cyclic;
        neighbourPatch  right;
        faces           ((1 2 5 0)(2 3 4 5));
    }
    right
    {
        type            cyclic;
        neighbourPatch  left;
        faces           ((6 11 8 7)(11 10 9 8));
    }
    
        inlet
        {
            type            cyclic;
            neighbourPatch  outlet;
            faces           ((0 5 11 6)(5 4 10 11));
        }
        
        outlet
        {
            type            cyclic;
            neighbourPatch  inlet;
            faces           ((1 7 8 2)(2 8 9 3));
        }
);


// ************************************************************************* //
