basicCaseTesting/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\

| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |

|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
expressions
(
    setPoiseuilleFlow
    {
        field U;
        variables "Ucl=1;H=2;";
        name U_profile;   // Custom name for this operation
        type expression;
        expression "(4.0*Ucl/(H*H))*pos().y*(H - pos().y) * vector(1,0,0)";
        keepPatches 1; // Keep patches
    }
);

